[
  {
    "id": "BE-ST-Q1",
    "title": "You have become aware that your company will receive a vulnerability assessment. You have been tasked with verifying that the technologies in use do not have any known vulnerabilities. What do you do?",
    "answers": [
      {
        "text": "I will compare our technologies stack with known vulnerabilities.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will not verify our technologies because the code was generated by an AI and AI never made mistakes.",
        "progress_bar": {
          "value": -5
        }
      },
      {
        "text": "I will compare that new features are not present in the previous vulnerability assessment report.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-ST-Q2",
    "title": "Your boss, after watching a movie about hackers, is afraid that our application could be vulnerable and exploitable for bad purposes. He has asked you to implement security tests. What do you do?",
    "answers": [
      {
        "text": "I will check that every user input is handled correctly and I will use automated tools that could help the process.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will focus on critical feature of the application that could be vulnerable.",
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will not pay enough attention on this because the application is not used by a lot of users.",
        "progress_bar": {
          "value": -5,
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        }
      }
    ]
  },
  {
    "id": "BE-ST-Q3",
    "title": "Your boss asked you to perform a vulnerability assessment and provide him with the report. What do you do after identifying vulnerabilities in a vulnerability assessment?",
    "answers": [
      {
        "text": "I will report some discovered vulnerabilities so I will have it for the next assessment.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      },
      {
        "text": "I will report all the discovered vulnerabilities and recommendations for mitigation.",
        "progress_bar": {
          "value": 5,
          "zone": {
            "offset": 20,
            "speedValue": 1.2,
            "length": 1
          }
        },
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will not report the vulnerabilities immediately because it will bring a lot of work in the next few days and I would like to rest some day before.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-API-Q1",
    "title": "The development team has developed a new feature recently, you have to test the new API introduced. Your goal is to ensure that the API works properly, what will you do?",
    "answers": [
      {
        "text": "I will focus on test that the response data should match the expected result.",
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will use diverse test data to cover a wide range of scenarios using unexpected data to test edge cases and validation errors.",
        "progress_bar": {
          "value": 5,
          "zone": {
            "offset": 20,
            "speedValue": 1.2,
            "length": 1
          }
        },
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will not focus on edge cases since user inputs are filtered on our application.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-API-Q2",
    "title": "During the testing of an endpoint you encounter an unexpected result of the application. What do you do?",
    "answers": [
      {
        "text": "I will ignore the result, change the test in a way that passes, and move on to the next test.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      },
      {
        "text": "I will document the issue and investigate the cause of the discrepancy.",
        "progress_bar": {
          "value": 5,
          "zone": {
            "offset": 20,
            "speedValue": 1.2,
            "length": 1
          }
        },
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will assume that the other testers have already tested the endpoints, so I won't bother.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-API-Q3",
    "title": "Testing an endpoint you got a message that indicates an internal server error. What do you do?",
    "answers": [
      {
        "text": "I will log the error details and report it to the development team for investigation because it indicates a server-side issue that needs resolution.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will ignore the error and continue testing other endpoints assuming it's a temporary glitch.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      },
      {
        "text": "I will retry the request multiple times to see if the error persists.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-CT-Q1",
    "title": "Your boss decided that the current software should be available on other devices and tasked you to verify if it is possible. What do you do?",
    "answers": [
      {
        "text": "I will conduct an analysis for software compatibility, highlighting critical aspects about various devices.",
        "progress_bar": {
          "value": 5,
          "zone": {
            "offset": 20,
            "speedValue": 1.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will neglect backend compatibility testing because I trust that any compatibility issues will be addressed during deployment or by other team members.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      },
      {
        "text": "I will avoid backend compatibility testing because I believe it's the responsibility of the backend developers, not mine.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-CT-Q2",
    "title": "Your boss colleague Mark Lizardberg asked you to prioritize compatibility testing efforts for a software project with limited resources. How do you approach the task?",
    "answers": [
      {
        "text": "I will prioritize compatibility testing based on the target audience's ensuring coverage for the most critical combinations first.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will skip compatibility testing for less popular platforms, assuming that the majority of users will not be affected by compatibility issues.",
        "progress_bar": {
          "value": -5
        }
      },
      {
        "text": "I will conduct compatibility testing only for the latest devices and browsers, disregarding users who may be using older versions.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-LT-Q1",
    "title": "You are conducting load testing on a web application and notice that the response time for a certain request takes several seconds. What steps would you take to address this issue?",
    "answers": [
      {
        "text": "I will analyze the performance metrics to identify the bottleneck in the system.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will consider the idea to report to my manager to scale up the infrastructure by adding more resources.",
        "progress_bar": {
          "value": 5,
          "zone": {
            "offset": 20,
            "speedValue": 1.2,
            "length": 1
          }
        },
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will do nothing because it can be related to a momentarily network problem.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-LT-Q2",
    "title": "Your manager Sally Filippini asked you to test how the application behaves if it is used by a lot of users. How do you handle this request?",
    "answers": [
      {
        "text": "I will analyze historical data and user patterns to simulate realistic workload scenarios because it helps in creating meaningful and relevant test scenarios.",
        "progress_bar": {
          "value": 5,
          "zone": {
            "offset": 20,
            "speedValue": 1.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will randomly estimate workload levels for testing without considering user behavior.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      },
      {
        "text": "I will test workload levels that match the system's capacity.",
        "anon_bar": {
          "value": 5
        }
      }
    ]
  },
  {
    "id": "BE-ST-Q1",
    "title": "You discovered that the system becomes unstable under stress. How do you handle this issue?",
    "answers": [
      {
        "text": "I will investigate the root causes and report possible optimizations that can improve the system’s stability under stress.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will ignore stress test failures and proceed with the software release as planned, otherwise we will miss the deadline.",
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will write tests that start to cause the system to become unstable, hiding this issue.",
        "progress_bar": {
          "value": -5
        }
      }
    ]
  },
  {
    "id": "BE-ST-Q2",
    "title": "Since your boss started a new hot event on our e-commerce web app, he asked you if the system works great under heavy usage. How do you proceed?",
    "answers": [
      {
        "text": "I will ensure that the system is ready because I have set up testing environments that simulate a lot of usage traffic.",
        "progress_bar": {
          "value": 5
        }
      },
      {
        "text": "I will conduct stress testing only in controlled environments since I am not comfortable to perform real-world scenario usage.",
        "anon_bar": {
          "value": 5
        }
      },
      {
        "text": "I will answer to the boss that the system works great under heavy usage because the system works great so far.",
        "progress_bar": {
          "zone": {
            "offset": 20,
            "speedValue": 0.5,
            "length": 1
          }
        },
        "anon_bar": {
          "value": -5
        }
      }
    ]
  }
]
