[
	{
	   "id":"DB-SCH-Q1",
	   "title":"You are tasked with Schema Testing during the validation phase, and you encounter a scenario involving heterogeneous databases in the environment. Your goal is to ensure consistency with the overall application mapping. How do you approach this situation?",
	   "answers":[
		  {
			 "text":"I will verify that the mapping formats of tables/views/columns align with the overall application mapping, ensuring a consistent schema.",
			 "progress_bar":{
				"value":5,
				"zone":{
				   "offset":20,
				   "speedValue":1.5,
				   "length":1
				}
			 },
			 "anon_bar":{
				"value":5
			 }
		  },
		  {
			 "text":"I will focus solely on the mapping formats within individual databases and ignore any potential inconsistencies.",
			 "progress_bar":{
				"value":-5,
				"zone":{
				   "offset":20,
				   "speedValue":0.5,
				   "length":1
				}
			 },
			 "anon_bar":{
				"value":5
			 }
		  },
		  {
			 "text":"I will dismiss the relevance of heterogeneous databases, assuming they have no impact on the schema mapping between front-end and back-end.",
			 "anon_bar":{
				"value":5
			 }
		  }
	   ]
	},
	{
		"id":"DB-STR-Q1",
		"title":"You find yourself in the Structural Testing phase where a recent code update introduces a new function with potential dependencies. How do you approach testing this new functionality?",
		"answers":[
		   {
			  "text":"I will avoid testing the new function, assuming that it won't impact existing code or create any unforeseen issues.",
			  "progress_bar":{
				 "zone":{
					"offset":20,
					"speedValue":0.5,
					"length":1
				 }
			  },
			  "anon_bar":{
				 "value":-5
			  }
		   },
		   {
			  "text":"I will thoroughly test the new function, analyzing its dependencies and ensuring compatibility with existing code.",
			  "progress_bar":{
				"value":10,
				"zone":{
				   "offset":20,
				   "speedValue":1.5,
				   "length":1
				}
			  },
			  "anon_bar":{
				 "value":5
			  }
		   },
		   {
			  "text":"I will passively include the new function in the testing process but won't specifically focus on its dependencies. ",
			  "progress_bar":{
				"value":10
			  }
		   }
		]
	 },
	 {
		"id":"DB-PER-Q1",
		"title":"You are in the midst of Performance Testing, specifically focusing on the Load Testing phase. A situation arises where the system seems to struggle with heavy loads and potential bottlenecks are suspected. How do you address this issue?",
		"answers":[
		   {
			  "text":"I will analyze the system's performance under heavy loads, identifying potential bottlenecks and optimizing the system to handle increased transaction volumes efficiently.",
			  "progress_bar":{
				 "value":10,
				 "zone":{
					"offset":20,
					"speedValue":1.5,
					"length":1
				 }
			  },
			  "anon_bar":{
				 "value":5
			  }
		   },
		   {
			  "text":"I will passively observe the system's behavior under heavy loads but refrain from taking any corrective actions, assuming that occasional performance issues are acceptable.",
			  "progress_bar":{
				"zone":{
				   "offset":20,
				   "speedValue":0.5,
				   "length":1
				}
			 },
			 "anon_bar":{
				"value":-5
			 }
		   },
		   {
			  "text":"I will deliberately escalate the load beyond its known capacity, aiming to induce a system crash, with the intention of uncovering potential weaknesses and vulnerabilities.",
			  "progress_bar":{
				"value":-5
			  }
		   }
		]
	 },
	 {
		"id": "DB-SEC-Q2",
	
		"title": "During the Log Integrity testing phase for the application’s logs, you discover that the retention period is set to 90 days, while the industry standard recommends at least 180 days. How do you address this issue?",
		"answers": [
		  {
			"text": "I will propose to extend the retention period to 1 year to ensure better traceability and investigation of incidents",
			"progress_bar": {
			  "value": 5,
	
			  "zone": {
				"offset": 20,
				"speedValue": 1.2,
				"length": 1
			  }
			},
	
			"anon_bar": {
			  "value": 5
			}
		  },
	
		  {
			"text": "I will propose to reduce the retention period to 1 week to free up storage space and ensure faster log retrieval and analysis",
			"progress_bar": {
				"value": -5,
	  
				"zone": {
				  "offset": 20,
				  "speedValue": 0.5,
				  "length": 1
				}
			  },
	  
			  "anon_bar": {
				"value": -5
			  }
		  },
	
		  {
			"text": "I will propose to remove the retention period and maintain all logs for an indefinite amount of time",
			"progress_bar": {
				"value": -5}
		  }
		]
	  },
	  {
		"id": "DB-SEC-Q1",
	
		"title": "During the Log Integrity testing phase for the application’s logs, you discover that the logs are not digitally signed or protected. How do you address this issue?",
		"answers": [
		  {
			"text": "I will report that it is necessary to implement a cryptographic validation for each entry so that the entire log chain can be verified",
			"progress_bar": {
			  "value": 5,
	
			  "zone": {
				"offset": 20,
				"speedValue": 1.2,
				"length": 1
			  }
			},
	
			"anon_bar": {
			  "value": 5
			}
		  },
		  {
			"text": "I will disregard the absence of log protection because even if the logs were tampered with, it’s possible to trace incidents or identify security breaches.",
			"progress_bar": {
				"zone": {
					"offset": 20,
					"speedValue": 0.5,
					"length": 1
				  }
			  },
	  
			  "anon_bar": {
				"value": -5
			  }
		  },
		  {
			"text": "I will introduce random irrelevant log entries into the system to produce noise",
			"progress_bar": {
				"value": -5}
		  }
		]
	  },
	  {
		"id": "DB-PER-Q2",
	
		"title": "You are tasked with conducting Endurance Testing of the system, running it under sustained load for an extended period of time. How do you ensure stability and performance during this prolonged test?",
		"answers": [
		  {
			"text": "I will closely monitor the system for memory leaks, database connection leaks, and overall performance degradation over the extended testing period, addressing any issues that may arise.",
			"progress_bar": {
			  "value": 5,
	
			  "zone": {
				"offset": 20,
				"speedValue": 1.2,
				"length": 1
			  }
			},
			"anon_bar": {
			  "value": 5
			}
		  },
		  {
			"text": "I will run the system under sustained load without actively monitoring for potential issues, assuming that if there are problems, they will manifest themselves in other testing phases.",
			"progress_bar": {
				"zone": {
					"offset": 20,
					"speedValue": 0.5,
					"length": 1
				  }
			  },
	  
			  "anon_bar": {
				"value": -5
			  }
		  },
		  {
			"text": "I will extend the testing duration beyond the established time frame until any potential issues are discovered.",
			"progress_bar": {
				"value": -5}
		  }
		]
	  }
 ]